Revit 2024 API
AnalyticalModelSelector Members
The AnalyticalModelSelector type exposes the following members.
Constructors
Name | Description
AnalyticalModelSelector()
 Creates a selector for the analytical model geometry.
AnalyticalModelSelector(AnalyticalCurveSelector)
 Creates a selector for the analytical model geometry.
AnalyticalModelSelector(Curve)
 Creates a selector based on a specific analytical curve.
AnalyticalModelSelector(Curve, AnalyticalCurveSelector)
 Creates a selector based on one portion of a specific analytical curve.
Methods
Name | Description
Dispose
Releases all resources used by the AnalyticalModelSelector
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CurveSelector
 The portion of the curve to be selected.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
AnalyticalModelSelector Class
Autodesk.Revit.DB.Structure Namespace